node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866910994052887
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866910994052887
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 8388397
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "\201\014^\275\343z\312\275\200\343\231=;\331P=\373\266\017\2766\257)>\314\344\035>P\325\207\276\366\263\234<c\225\307\275\275\024\026<\372\2059=\233\245\362\275(\226[\272 \367h<S\032\276\275Z\304\376=>S\366\2757\213A=$\266 >\255(\254=?,\013>\017\2429<&\254\026\276\035R\360\274\"\"\335=\350I\215=\254\202\204\276\301\223\205\273\216:S=C&\335;\275-\354\275\345\222\360=!\204M\275|\027\007\275K?:;\360\274\300=e\010\245<\214[\254\276?e\002\273u\242D=!;\272\274K\301\340=\27266>3\366\270>\250\240&\274`\263\351=\017\217\260=\266\227\347=P\245\356\275=W\010>\302\372\360\275`\332\214\276Q\'\277<\220`\201\276\305=a\276\006\026\305=\025UG\275\025b:\274\356bU\275\225l\017=\347U\213>\254\206.=\037:\234=:bi>W}$>\337B\312\275V*\303=d\n\211;;\275\006;,~\024\276\222\215\234>\265g\334\275x])=\373\332\353=\265#\033<Kl\"\276B\270\231=-\346\275\275+\326L\275#\351\234\274W\243l=\235\035\016>\2718/\275c3\202\275S\267-\275\337\366\247=\022\216\204=\244\2348>\027\216\t=\226\373\\>\270\215\202<\003\320\371;9e\342=\230\200\023>\321\332\366\275\372\204g\276Z\001_>\227\272\246\273\177/\347\274\252\374\205\276\225\341B=\255\221\010<\253\0073\276J\251\031>\3206b\275\001\365\345\275\265O\215\276-9@>{f\267=-\267\357=\214\321\316\274ef\344\275\311\200A=\022\365\242\275\030)c\276/_\214=\376o\357<KQ\351\275\325\000\244=\353\361@>\343\024*=\"V\250=\335\204\002=\314\357S=\320\241\264=\201\\v=\253\2232=PfE\276\364Tt\273]\247\277\275K]i\275B\352u\274@g!\276o\2064\275X\367\202\275a\305\323\275\256A(>\006OR\276\273k:\274Q\036\322\274/R\021={\023u\276\361\031!>K\226\r\275\032)\223\274M\261\256\275UI\260=\r\207\200=\006qE>\2070\343=T\030\231\274A-[>=\362\000\275\366=J\276_M\005>#\371D>u\205u\274\203;\261\274*\201\265<\207 (\276\021\177\333=x\244\355=aE\025>\377\252\211\275\215\236\251\274\245\034\024>\272\034\231\275\361{*\276\177p\224=\376\372\022>\373X\t>t7\256=\2153*\275#\354\213\276\203~v\275\241\340\256\275\207\360\326\275\257\222\257>\310\334\224>bt\227>\025\017h\274\263@/>8;\032\276\003\223\313\275Q_k=t \203\275]\013\207=l\236\267=\202\3409\275B\307i>\210\302\314=v0\010\276,\363\333\2754\361\266\275\006\223\333<\023\255\013=\323?\356\275i\241\315<\224\007=>N\177\356\274>-\201\274X\0045>=U\n\276\237\366}\276q=}\275\270\331W\2766z\200\275\005\323s\276\376\373\337\275\213\250P>\231G(\276 \301\027\2763\243\256\275\240\017\n=\225 \014\275\311\330\002>\006V|\274\027~\034>\017d\t\276e\013U\275\227\236\202\276^4\334=T\201\355\275T}9\276\352:D\276\312i\032\275\377\035\210\275\247\233\346=\337NP\274z\364b:\375\371\004<\013L\020\276ip\022\276*a\234<D}\203\274\310\325\257\274\222\022\"=\251\254|>\360\306j=\376S\032>\313\036\265\275\231vV\275QM\007=\202)\'\276\207\226\275\275<\017\001>\256>\335\275*\316\035\275\375\223Z\276\364b/=\027\343\302\2759\306o\275\302l>\275K\272\233=\202\0132\276\003Ir\276\250\020\035=\3657R\275\"9\316\274-\222\227=B\211\010\275+\356\034\275\272d\250=P\t\t>Yb\314=<\210B\276\210m=\275l\'.\276\245\240i>\205\035c=1\033\326=t\2307\276\275\010\235\275\355\351\277\275S\271\334=\024i\217\276p?\234\274\210\226W>\217\331E\2765\221\257\273*+\021<\022\222\241\276\345S\262=5&J=\245\336G=\316R\026\275?\030\010\276M\\\025>\t]\033\276gHF>\343\032\026>~\333r\273g\256/\276\256\003\317\275\247\005\0008\301\317&>\350w\311=\226TE\276\233\n\247\274\322\244\213<_\237\r=\004\367K=\002\020\206=w\375\261<AT$>!>\004\276\305\177\221=\014\322\351=\220c\376=\232\367\026>\024\r\032\275:\337\222=fc\271\275>\365\317\275\213x\036=\273(\314=\327\241\004\276\r\207\275\275\257[\312\276Q\360\334\275\315\266_>1Cj\276\330\2716\276\323,\345=\026\252\263=Vu \276<\376\216=\327\214\201\275\274\231\276\273\2436|\275\013\242\201=\235LA\276\223.\377:\321p\252\275E\235\242>\034*\032\276\006\t\002\274@\213\022\276\361\t\222\275\316\215\031\2761\205h\276Rs\257\273-\344S=34\270;\207+\370=\213%F\276\\?\300<\320T\265\275\241 \261<A\210!\275n\2332\276\314n\240\274\217eC>\262\277\202\274\r\027\000\276nq@>\254\322\227=\277\316\374=\244j\216\274)\350\025\275\312T\225<o\240\225>\014\300\031\275w\245g<v\024\250\275\260\240&>3 \023<\227\270\235=\3458%=\023\'\270\275\225\177\220\274i\213\356=\207\003b\275K>\321=s\317\255=p\302\027>\244\251\036\276\213J\217=i/\300<OQ\225=\035l\221\276\227\266W\275\037T?\276\250\312\277=\265\033D=V\242\224\275fw}=b\266>\275\265^\314\274K\031\202>N)^=^\214^>\362*T>\345\221p<G|,>\001\352c\276\271B\224=\256{\030=\253S\314\275\316\007\246\276\254\036T=0\205|=I\211\">TF\301\274)F0\275\311\250\036>\352\036\232>\006\254\222\274l\254\246={e\216\273\206\254\346\274\233.\305\275\331)-\276\013\304\022>[\\\367=\2004Y\2745\030r\274V}$\276\325\340\003>\372\245h\275\336B\215\275T\204\350\275r=\233\274\276\203\033=\017\233\027=\220\244G\275\n\326\215=\013\255\327=\242tz\275\377I\242\27669s\276\037\332%\276\327\355\364\274\177\217$>\032\010\221\275\266h\372\275z\227\032\276\007\347H=\341\230\365\275{\010,:\325i\225<\r\303\244>\"\240\344<\251A\246;fU\232\275\254\212\033<\300\216\300\275\003\200\205\275\316M|\275\324\321\356=\023\022\031>\271\177\010\276\237\261\315=\332\270\256\275\320X\326=\354!w\276\355d\255\276^\245\324\275~t\300<\345\036\264<\036\311\027>3\302\033>4\212;\274\'\210\216=n\235\032\276<\0221=\237\226m=\301\304><9{\336=\225\3549\276\023\347\267\274\342\311\316=[\341\001\276\347x\373\2753\362\313\275\220\004\242\275V\n\220=63\236>\024\355\301\275\020\020\036>i\235\257\274\337w.>\037\220\t\275`S\343<bt9=a\314\352=)\032\030=\216d\006\275X\355,>d\350*\275t4\\=UU\260\275\200!\353\274\325\376:>\302;\177\276I<Q\276\343\023\274\275I\022=>S\376\245\275&\177\027\273+\316\212>\315\301z\276\305a\035>R)\324\274L\032h=FX\230\274\261\330\376\275\352;\350<\300\317\321\275\006\300\207>x\323]\273\231\325\000>\251\337\233=\001\373\376\275XsG;Ce\252=\025\350\325=\356\376,>,\3233>sz\340=q;\241\274w\354\221\275:\037\356\275\020\330\246;\310\023\301\274%\032\255<M\250\337=\224e7\274h\222\353=\362\366\363=\241__\276:\020K<\217f\230=\332\021\240=\n\333\">\251\231\251\275[O\000>\345\367\340\271}\356\304\276gz\215=\210\3540>s\300L\276\217\215\214=\203\036\225>!`\224\276\3176\263=A\375\210\274\345q\202<\213\365\334<\030\372\202>\371;/>O\230R=\371\344\301=O\310\300\275\24210=\001\377\325<\214\267\362\275\373\276\022=P1\317=\206\330O\275_\333\324\275\252]\336\274\356\300P=\tf\002>\211y\203=\213\246\005\276$\262z=\230\314\217=\250\344\220\275\242\274V>d\235\010=\027\341\t>VA\030\276!\032>\275\324o\361=\324\2112\275~\263\252\276\330\373\307\2755*\303\273\323\275\376=\351\302\335\272Z\006o\276\310\"M\276\034\020\211>[\317\222\275\253\373\301\274\270\324\312=\013\033j=\237\376\317=\322\034B<\305@@=\036\262\026\276\213\367\001>\237\266\353\275\r\032\354=\027\223\321\274\'\235\t\275}$\026>\026\342\254=\2213\276=\202\311\004>0\037P=i\215\347\275\237i\261\275Q&\036<\241\217)\276\000\030)\276n/&=H\275\007<\341\355t<$)[<\202\177\243>Q\341\017>xIm>W\263?\276\236\220\'\275,\n\236\274\375e\361=\253\300\254\275\226\026\005\276\372?F\275u/\343\275\355\363I=-\363\245=\023\354\202\275\267\331\006>l\324->O\304\211\275\017\374\320;\356.\r\276A+\225\2751\315\257<\341\203\'>l\304\304\272yo\330\275\327\373\245=\353\327\217=\331K\201=d\352\312\275\365c^=z,\246\275dI\256\275z\332\'=Ykv>\016\"\227\276E\355\200\275Y\276\225\274J\025\276=)}\025\276\214\241R\2761?\210\276\312/\332=\362\304B\276\365\2347\276@\213\345=\203D\207=\224o\305;\237w\026>~Pb>[\027\016>\224M\036\276\312\330G\2752\327\255\275\324\212\t>\231*\201\276\306\025\243\274,b\020\276\31383\274q\332\010>\021\357I\275Y\257\210\275B\017+>\035\264G\276&\307u=\207\224 =L{\317\275\333L\246=x\212B\276\202+\365\275he,=T@e=\036\325\313\275\307\023\244<\347v\227=<0\035=\025\342\032>\264\256\272\276\341\256\256<(\371s\276\262Q\253\275\375\237J\274-\230X=\345\355A\276gk\350==\332R=G\300\n=\216Q\355\275{\020\177\275._\r\276WJ\016\276\201\353\270=\370\205\t>\225|\256\275\342\214\201\275\035\017\300\275}\323\203\276\020j\356\275h\202S\275m\301\021\275\240\216z=\232\005$\276\263uE\276D\230T\276\323\023\000=\'5I\275\204r_\276V\265a=\237\034&\276={\276=A\010I<U`\200\275\207\0206\274\016\241\251\275\351\226\240=\277\220\004>),|=\372\345@=\275\363\223<;]%\274[\340q>\037\314\224\275\223jB>X\377#>\357ro>C\323\">\205\007W=YO\023=\246Q\375=3\322\031>4\001\244\275\250q=>\314\357\254\275\311?~=\351\263\016<\201\212->\252g\202\274\2760\355=\"\204\204=B\230a\276\230\237\221;\310X\216=\356d\230<\031R\257<\377\264\332=\n\277\222=\023\177Y\275\303\226\230\275\027\213L\276\211\221H=\323G\016=\333>\244;O\3025>\322S\316\275>\320\307\275\241ux\275\260\277\212<\310h3\275\257\246\351<\241\366j=\260\326\234>\214\226^>?Q\215>\236s\264\276{L$\275\023q\352\275\246\334\204>?\254V\274\036\234\020\275\275V\266\275\223\367~=%\r\243<f\330\'\273RV\177>\226\t\262;\2069\306=\227`7>m\346~>\330\232\241\274\326\326\223\276\333\251\313=\212\236n\275\316R\006>a*s=\256\263\t>\354S\243\276\202o0>\344\234\341\274#\224\013\276\203\277\225=\276\363\220;#\310\374\275\220\352%<\263\327\223\275IUR=\021\244S;\t\351\213>ND\217=\324\344\003\276s\363\274\275\202[\022\276\276\200\205=\\\360\313\275\010!\027\275b\344W<wZD\275p\312\202\275flZ\274\356\360E>z\357\t>\371\t\323\275\231\002\275\275d=5\273/\216\355\275m\351\314<\203y\004\276\220\212\026\276l\037\'>+\001\207\276S\366\223<r\026R>!;V<\306\277\353\275\007\313\237=\000\326\022\275\302]\'\276bOG\276\033\246\300\275f\323Z=\360\303\215\275.,)>\276Rj>q\276&>\346\t\201\275\232\307u<9x\201\275f\245\306\275\246\313*\273\003\377)>g\366\005\276\362\002\263=H\243U\276\026\313\321\274\t\257\222=\320v\214\275x\023Y>U\'\033\276Z~T>Zm!>b\275\322\275\304\020i\275\306\211>\276\344\3621\275\343\224E\276P\264\314;1\2735>\276\345\225>B\357\212\275`\361=\275\347r\356\275HE\222=6|n\275\024[\320=\300\342x\276\333\241_\276s\255\236<\312\220\373\275\014\324\361\274\335IO>k@[>+n\222=,5\316=\312d\020> %=>\315\340.<\337\327&=\342\365\226\273\302A\356\275Bd\362=c\r\n\275\023^\010\275\017\221\374\274\363\206\013<\220\241\000>\347`)\275\274\001A\275\265z\356=\327^6\276\220\005\337<\326\353\345\275\037/\312=\273u\372\275\0241\210\275\267\204\256\273\341\265\030\275\362\2513=\202i\322\275\372\316!\275vm#\276r\265\273\273c\270@\275\337^9\276c\375*>\345H\366\275\321sl\275&\252\246\275\260Kk=A\226\200=\211&\033>\244\312+>43\357=\253>9>;\"\251=\235xH\276\272h\353\274Q\260\036\275\277Z\350=\220\343\'>\320\306\246=>\303E\274=!:=r\301\244>\247\310S>\307\343\250\275\345J\225\276\375A\233\275\354\240\305\275.\014\355=\315h\314\275\201\374\270\275\\\023j\274\325v{\276lzN\275\317\177\027\276|\301\026\2765\320\302<\343e\240\275E\177]\275z\322\227=\022\234_>\230\027}\2766\351\317=\372C%\276>\010#\273/\251s\276q\271\325=q\317\217\274\301\210\357\274\242\212\020\276\353\003\'\275\022\006\036=\366;\352\274\365\233\220\276\002\346\217<\333fO>\251L\260\275\267\032\313\274\310\242\353=\244\020\222\274\\K\250\275:\2653\276\321\365\314=L\236\\\276\026\037\243\274Ns\234>\330A\261=\003\313#>-O\203\276\017\353V>\346\357n\276\0136\217\275\t\007k\273\240\257\335<\242%\264=\217!\204\275B\"\016>\'s\201\275W\232/\275\275B\031=\264\010\026\275Ap\346\275\333\334&\275/\274W>\355\206{\276\035$\332\275\263\362F\275\335H\236=6\315?>?\226\303=\217\314D=\232\221\t\273\201^W\276\363\232\314\275}\255O>\225/<\276\"X\265\275\266!\002\275\361\202\364=g\340\021=Q\364\001\2764\311\211\274_\332\317=\362X5\274\023\2302\275\235b\244\274\320\243&\276\004\246X=;\346\343<|\312\026\275\211\320\">9\301m\276\311u&>\352\346p>(5\332\274\210W\027=H\026\224=\331\365$>\302\246O=-W\343<\372\351r\275\345H\035>#.^\276\323\242i\274\256\304\001\275\022a\311=\326\003\263=\206(K\275T\014L\276bO$\274\231\214\217\2758$F;\373\377V>f\357#>N\243\273=s\271\240>\355\004\243<L\031\325<2Z\352;\350\370\232<\256\241+>2\324\004\276-\024\230<7i5\275\237\000I\276\306)]\275y\363\007>\027\214\207=T@`>}\267\260\275`\034\371<\220\022\335:\375\331\263:\336\\5=\231\220\346\275\376\035\304;\255\316D\276\261\312\220=\010gA\276\340Uo>8\251\356\274|+\262<#G\371=\007\356\306\275OS\307<\177\264*>\r\303X>\005\367\220\276-\254l\275\237\373\223=f\203\272=\037cc\275\303S\244=I\254F>9\260\002>\010j\002\276\253\351\272\276\307_C\275s\002c\276+\371\320<\357\330\211\275\007\026\305<7\312L=\354\3121\276\242\324\236>?Q\313=\021\261\222\275\343\r\t\274\263P\203\275K\236\311=Vv\214=s3\247\275\003Z\031>\201\263\351\275\350\344R\276:\177\312;\256.\034\276\265\265j\276\302{6\276\275V\351\275E\2739\276\366\263\326\275\367MD>7\002\030=\020y\017=N\2119<*\342N:\001\347\243\275\016\3345>\325\214\263<GT\305=\336A \270q0\\=\331\035o=\357\n\233\275\307\342\260\273\034Y\375=\r\331\217\274}t\036\276\177yV\276\300\366\344=\241Y`\275]2\001>>\017\013>9\202N=,\350\266\275\021i\350\275\345\004\013\276\311\257\020=&\213S=t6M>\370g\367\275\200_\207\275\376\033*\276]\036\234\274*\006\360\273D\212\243=\262M\315\275U\025\332=N}\215>,\237Z<\346\353#\276\035M\004>\036\263\342\275a\\*>\352\254\270\275\213\030\255\275\r\242f= \317\014\276\203\227\013\276\027\215\241>7\245\312=\352\324k\275V\247<\276=J\223\275\340\200\247>h\360\361=f\375\001=1\330\245\274p\211*>\0304\'=\354\030$=\227\240\233\275\300\340\272\275\303\230\014\276\203\034\222\275\263\205\033>\211\226E=r\262;>\320\300n>\205\"\017\276\355\331\021>\322\232\010>q\\^>\"\213\326\274\336\232\005\276\266\257?<Q\264\t\276\207\235_;\252\016\352<\274\323\036>w\337\210\274M\320\376\275*h\234<\363\361\342\275b\305>\276\227\221\343=w\347\246=\362pw=\332s<=\037 \264<"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/Shape_1"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_11/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/strided_slice_11/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_11/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_11"
  op: "StridedSlice"
  input: "net/Shape_1"
  input: "net/strided_slice_11/stack"
  input: "net/strided_slice_11/stack_1"
  input: "net/strided_slice_11/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/Shape_2"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_12/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_12/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_12/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_12"
  op: "StridedSlice"
  input: "net/Shape_2"
  input: "net/strided_slice_12/stack"
  input: "net/strided_slice_12/stack_1"
  input: "net/strided_slice_12/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones/mul"
  op: "Mul"
  input: "net/strided_slice_12"
  input: "net/strided_slice_11"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones/Less/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1000
      }
    }
  }
}
node {
  name: "net/ones/Less"
  op: "Less"
  input: "net/ones/mul"
  input: "net/ones/Less/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones/packed"
  op: "Pack"
  input: "net/strided_slice_12"
  input: "net/strided_slice_11"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "net/ones/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones"
  op: "Fill"
  input: "net/ones/packed"
  input: "net/ones/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.20000000298023224
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
